src/main/resources/xml/accommodationFulfillmentServicePort/publishRoomUpdates/publishRoomUpdates.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:publishRoomUpdates>
         <request>
            <!--Optional:-->
            <travelPlanId>?</travelPlanId>
            <!--Optional:-->
            <travelPlanSegmentId>?</travelPlanSegmentId>
            <!--Optional:-->
            <travelComponentId>?</travelComponentId>
            <!--Optional:-->
            <staus>?</staus>
            <!--Optional:-->
            <startDate>?</startDate>
            <!--Optional:-->
            <endDate>?</endDate>
            <!--Optional:-->
            <facilityId>?</facilityId>
            <!--Optional:-->
            <newRoomNumber>?</newRoomNumber>
            <!--Optional:-->
            <oldRoomNumber>?</oldRoomNumber>
            <!--Zero or more repetitions:-->
            <comments>?</comments>
            <!--Optional:-->
            <action>?</action>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:publishRoomUpdates>
   </soapenv:Body>
</soapenv:Envelope>
